# SSD with Mobilenet v1 FPN feature extractor, shared box predictor and focal
# loss (a.k.a Retinanet).
# See Lin et al, https://arxiv.org/abs/1708.02002
# Trained on COCO, initialized from Imagenet classification checkpoint

# Achieves 29.7 mAP on COCO14 minival dataset.

# This config is TPU compatible

model {
  ssd {
    inplace_batchnorm_update: true
    freeze_batchnorm: false
    num_classes: 2
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    encode_background_as_zeros: true
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
        reduce_boxes_in_lowest_layer: false
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width:  300
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        depth: 256
        class_prediction_bias_init: -4.6
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            random_normal_initializer {
              stddev: 0.01
              mean: 0.0
            }
          }
          batch_norm {
            scale: true,
            decay: 0.997,
            epsilon: 0.001,
          }
        }
        num_layers_before_predictor: 4
        kernel_size: 3
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v1_ppn"
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 4e-05
          }
        }
        initializer {
          random_normal_initializer {
            mean: 0.0
            stddev: 0.01
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.97
          center: true
          scale: true
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    loss {
      classification_loss {
        weighted_sigmoid_focal {
          alpha: 0.25
          gamma: 2.0
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-1
        iou_threshold: 0.6
        max_detections_per_class: 32
        max_total_detections: 32
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  fine_tune_checkpoint: "/media/ssd/datasets/drones/training_demo/ssd_mobilenet_v1_ppn_shared_box_predictor_300x300_coco14_sync_2018_07_03/model.ckpt"
  #fine_tune_checkpoint: "/media/ssd/datasets/drones/training_demo/ssd_mobilenet_v0_fpn_shared_box_predictor_640x640_coco14_sync_2018_07_03/model.ckpt"
  #fine_tune_checkpoint: "/tmp/train/6/model.ckpt-164785"
  #load_all_detection_checkpoint_vars: true
  from_detection_checkpoint: true

  batch_size: 64
  sync_replicas: false
  startup_delay_steps: 0
  replicas_to_aggregate: 1
  num_steps: 200000

  data_augmentation_options {
    random_horizontal_flip {
    }
  }

  #data_augmentation_options{
  #  ssd_random_crop_pad{
  #  }
  #}

  data_augmentation_options {
#random_crop_image {
#  min_object_covered: 0.0
#  min_aspect_ratio: 0.75
#  max_aspect_ratio: 3.0
#  min_area: 0.75
#  max_area: 1.0
#  overlap_thresh: 0.0
#}

#random_crop_pad_image{
#    min_object_covered: 0.0
#    min_aspect_ratio: 0.25 # w / h
#    max_aspect_ratio: 3.0  # w / h
#    min_area: 0.1
#    max_area: 1.0
#    overlap_thresh: 0.3
#    clip_boxes: true
#}

#ssd_random_crop_fixed_aspect_ratio{
#}

      ssd_random_crop_pad{
          operations{
              min_object_covered: 0.0
              min_aspect_ratio: 0.5
              max_aspect_ratio: 2.0
              min_area: 0.1
              max_area: 1.0
              overlap_thresh: 0.0
              clip_boxes: true
              min_padded_size_ratio : 1.0
              max_padded_size_ratio : 4.0
          }
      }
  }

  optimizer {
    momentum_optimizer: {
      learning_rate: {
        cosine_decay_learning_rate {
          learning_rate_base: 0.1
          total_steps: 200000
          warmup_learning_rate: .013333
          warmup_steps: 2000
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  max_number_of_boxes: 32
  unpad_groundtruth_tensors: false
}

train_input_reader {
  label_map_path: "/media/ssd/datasets/drones/drone_label_map.pbtxt"
  shuffle: true
  tf_record_input_reader {
    input_path: [
        "/media/ssd/datasets/coco/record/coco_train.record-00087-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-21",
        "/media/ssd/datasets/coco/record/coco_train.record-00093-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00092-of-00100",
        "/media/ssd/datasets/drones/records/png.record-1",
        "/media/ssd/datasets/coco/record/coco_train.record-00006-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-18",
        "/media/ssd/datasets/drones/records/png.record-26",
        "/media/ssd/datasets/drones/records/png.record-33",
        "/media/ssd/datasets/drones/records/drone.record-19",
        "/media/ssd/datasets/coco/record/coco_train.record-00014-of-00100",
        "/media/ssd/datasets/drones/records/png.record-11",
        "/media/ssd/datasets/coco/record/coco_train.record-00064-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-0",
        "/media/ssd/datasets/coco/record/coco_train.record-00036-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00019-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00079-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00007-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-7",
        "/media/ssd/datasets/coco/record/coco_train.record-00061-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-16",
        "/media/ssd/datasets/drones/records/png.record-32",
        "/media/ssd/datasets/drones/records/ximg.record-13",
        "/media/ssd/datasets/coco/record/coco_train.record-00002-of-00100",
        "/media/ssd/datasets/drones/records/png.record-16",
        "/media/ssd/datasets/drones/records/drone.record-2",
        "/media/ssd/datasets/coco/record/coco_train.record-00018-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00074-of-00100",
        "/media/ssd/datasets/drones/records/drone-net.record-4",
        "/media/ssd/datasets/coco/record/coco_train.record-00042-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-24",
        "/media/ssd/datasets/drones/records/drone.record-27",
        "/media/ssd/datasets/drones/records/drone-net.record-10",
        "/media/ssd/datasets/drones/records/png.record-6",
        "/media/ssd/datasets/coco/record/coco_train.record-00094-of-00100",
        "/media/ssd/datasets/drones/records/png.record-31",
        "/media/ssd/datasets/drones/records/drone.record-32",
        "/media/ssd/datasets/coco/record/coco_train.record-00078-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00003-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00023-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00096-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-11",
        "/media/ssd/datasets/drones/records/ximg.record-10",
        "/media/ssd/datasets/coco/record/coco_train.record-00031-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-5",
        "/media/ssd/datasets/coco/record/coco_train.record-00081-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-8",
        "/media/ssd/datasets/drones/records/drone.record-12",
        "/media/ssd/datasets/drones/records/drone.record-31",
        "/media/ssd/datasets/drones/records/drone.record-29",
        "/media/ssd/datasets/drones/records/drone-net.record-7",
        "/media/ssd/datasets/coco/record/coco_train.record-00098-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00076-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00070-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00072-of-00100",
        "/media/ssd/datasets/drones/records/drone-net.record-9",
        "/media/ssd/datasets/drones/records/png.record-9",
        "/media/ssd/datasets/drones/records/png.record-36",
        "/media/ssd/datasets/coco/record/coco_train.record-00025-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00010-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00099-of-00100",
        "/media/ssd/datasets/drones/records/png.record-7",
        "/media/ssd/datasets/drones/records/ximg.record-6",
        "/media/ssd/datasets/coco/record/coco_train.record-00084-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00068-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00037-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-15",
        "/media/ssd/datasets/coco/record/coco_train.record-00091-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00017-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-2",
        "/media/ssd/datasets/coco/record/coco_train.record-00027-of-00100",
        "/media/ssd/datasets/drones/records/drone-net.record-8",
        "/media/ssd/datasets/drones/records/drone.record-30",
        "/media/ssd/datasets/coco/record/coco_train.record-00016-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00015-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00028-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-11",
        "/media/ssd/datasets/coco/record/coco_train.record-00085-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-20",
        "/media/ssd/datasets/coco/record/coco_train.record-00069-of-00100",
        "/media/ssd/datasets/drones/records/drone-net.record-6",
        "/media/ssd/datasets/coco/record/coco_train.record-00051-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-25",
        "/media/ssd/datasets/drones/records/png.record-3",
        "/media/ssd/datasets/coco/record/coco_train.record-00005-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00065-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00067-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00052-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-6",
        "/media/ssd/datasets/drones/records/png.record-5",
        "/media/ssd/datasets/drones/records/png.record-27",
        "/media/ssd/datasets/drones/records/drone.record-4",
        "/media/ssd/datasets/coco/record/coco_train.record-00060-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00038-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00000-of-00100",
        "/media/ssd/datasets/drones/records/png.record-18",
        "/media/ssd/datasets/coco/record/coco_train.record-00082-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-7",
        "/media/ssd/datasets/coco/record/coco_train.record-00049-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-17",
        "/media/ssd/datasets/drones/records/drone.record-16",
        "/media/ssd/datasets/drones/records/drone-net.record-1",
        "/media/ssd/datasets/coco/record/coco_train.record-00029-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-3",
        "/media/ssd/datasets/coco/record/coco_train.record-00030-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00088-of-00100",
        "/media/ssd/datasets/drones/records/png.record-34",
        "/media/ssd/datasets/drones/records/png.record-22",
        "/media/ssd/datasets/coco/record/coco_train.record-00039-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-14",
        "/media/ssd/datasets/drones/records/png.record-20",
        "/media/ssd/datasets/drones/records/drone.record-22",
        "/media/ssd/datasets/drones/records/png.record-14",
        "/media/ssd/datasets/coco/record/coco_train.record-00080-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00056-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00089-of-00100",
        "/media/ssd/datasets/drones/records/png.record-10",
        "/media/ssd/datasets/coco/record/coco_train.record-00053-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00055-of-00100",
        "/media/ssd/datasets/drones/records/png.record-23",
        "/media/ssd/datasets/drones/records/ximg.record-4",
        "/media/ssd/datasets/coco/record/coco_train.record-00011-of-00100",
        "/media/ssd/datasets/drones/records/png.record-21",
        "/media/ssd/datasets/drones/records/ximg.record-0",
        "/media/ssd/datasets/drones/records/png.record-2",
        "/media/ssd/datasets/coco/record/coco_train.record-00022-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00073-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00047-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-23",
        "/media/ssd/datasets/coco/record/coco_train.record-00066-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00043-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00001-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-8",
        "/media/ssd/datasets/coco/record/coco_train.record-00054-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-9",
        "/media/ssd/datasets/coco/record/coco_train.record-00033-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00058-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-9",
        "/media/ssd/datasets/coco/record/coco_train.record-00071-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-26",
        "/media/ssd/datasets/drones/records/drone.record-1",
        "/media/ssd/datasets/coco/record/coco_train.record-00090-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00044-of-00100",
        "/media/ssd/datasets/drones/records/png.record-15",
        "/media/ssd/datasets/coco/record/coco_train.record-00063-of-00100",
        "/media/ssd/datasets/drones/records/png.record-17",
        "/media/ssd/datasets/drones/records/drone.record-28",
        "/media/ssd/datasets/coco/record/coco_train.record-00004-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00075-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00026-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00045-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00041-of-00100",
        "/media/ssd/datasets/drones/records/png.record-35",
        "/media/ssd/datasets/coco/record/coco_train.record-00009-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00097-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00062-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-5",
        "/media/ssd/datasets/drones/records/png.record-30",
        "/media/ssd/datasets/coco/record/coco_train.record-00048-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00024-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-13",
        "/media/ssd/datasets/coco/record/coco_train.record-00032-of-00100",
        "/media/ssd/datasets/drones/records/drone.record-14",
        "/media/ssd/datasets/drones/records/drone-net.record-5",
        "/media/ssd/datasets/coco/record/coco_train.record-00077-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00008-of-00100",
        "/media/ssd/datasets/drones/records/png.record-25",
        "/media/ssd/datasets/drones/records/png.record-28",
        "/media/ssd/datasets/drones/records/png.record-4",
        "/media/ssd/datasets/coco/record/coco_train.record-00057-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00083-of-00100",
        "/media/ssd/datasets/drones/records/png.record-24",
        "/media/ssd/datasets/drones/records/ximg.record-12",
        "/media/ssd/datasets/coco/record/coco_train.record-00020-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00046-of-00100",
        "/media/ssd/datasets/drones/records/ximg.record-15",
        "/media/ssd/datasets/coco/record/coco_train.record-00021-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00095-of-00100",
        "/media/ssd/datasets/drones/records/drone-net.record-3",
        "/media/ssd/datasets/coco/record/coco_train.record-00035-of-00100",
        "/media/ssd/datasets/drones/records/drone-net.record-2",
        "/media/ssd/datasets/coco/record/coco_train.record-00034-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00040-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00012-of-00100",
        "/media/ssd/datasets/drones/records/drone-net.record-0",
        "/media/ssd/datasets/coco/record/coco_train.record-00086-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00059-of-00100",
        "/media/ssd/datasets/coco/record/coco_train.record-00050-of-00100",
        "/media/ssd/datasets/drones/records/png.record-13",
        "/media/ssd/datasets/drones/records/png.record-29",
        "/media/ssd/datasets/drones/records/png.record-19",
        "/media/ssd/datasets/drones/records/png.record-8",
        "/media/ssd/datasets/drones/records/png.record-12",
        "/media/ssd/datasets/coco/record/coco_train.record-00013-of-00100",
        "/media/ssd/datasets/drones/records/png.record-0",
        "/media/ssd/datasets/drones/records/ximg.record-1"
       ]
  }
}

eval_config {
  num_examples: 2000
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}

eval_input_reader {
  label_map_path: "/media/ssd/datasets/drones/drone_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: [
        "/media/ssd/datasets/drones/records/drone.record-10",
        "/media/ssd/datasets/drones/records/ximg.record-3",
        "/media/ssd/datasets/coco/record/coco_val.record-*-of-*"
    ]
  }
}
